Melting/validatin_ga_2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            patch;
        nFaces          60;
        startFace       9460;
    }
    rightWall
    {
        type            patch;
        nFaces          60;
        startFace       9520;
    }
    upperWall
    {
        type            patch;
        nFaces          80;
        startFace       9580;
    }
    lowerWall
    {
        type            patch;
        nFaces          80;
        startFace       9660;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9600;
        startFace       9740;
    }
)

// ************************************************************************* //
