Melting/validatin_ga_2/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//rho             rho [1 -3 0 0 0 0 0] 776.6;
rho              6095;

//liquid phase
//cpl             cpl [0 2 -2 -1 0 0 0] 2100;
cpl             381;
//lambdal         lambdal [1 1 -3 -1 0 0 0] 0.14;
lambdal         40;
//nu              nu [0 2 -1 0 0 0 0] 5.72e-06;
nu              2.97e-7;

//solid phase
//cps             cps [0 2 -2 -1 0 0 0] 5000;
cps             370;
//lambdas         lambdas [1 1 -3 -1 0 0 0] 0.45;
lambdas         32;
//beta            beta [0 0 0 -1 0 0 0] 8.65e-4;
beta            1.2e-4;

//Ts              Ts [0 0 0 1 0 0 0] 307.25;
Ts              302.5;
//Tl              Tl [0 0 0 1 0 0 0] 308.45;
Tl              303.0;
//L               L [0 2 -2 0 0 0 0] 222000;
L               80160;
//DCl             DCl [1 -3 -1 0 0 0 0] 1.0e8;
DCl             1.0e8; 
//DCs             DCs [0 0 0 0 0 0 0] 1e-06;
DCs             1e-06;


// ************************************************************************* //
